
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
                                      College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user Stata perpetual license:
       Serial number:  10699393
         Licensed to:  Andrey
                       

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.

. do Code/pilot_analysis.do ./Temp/pilot_analysis.log 

. 
. **THE SCRIPT TO ANALYZE THE FIRST PILOT's RESULTS***
. set more off

. clear all

. 
. *put your working folder below:
. cd C:\Tornado_warnings\Experiment\Alerts_Experiment
C:\Tornado_warnings\Experiment\Alerts_Experiment

. log using "./Temp/pilot_analysis.log", replace
(note: file C:\Tornado_warnings\Experiment\Alerts_Experiment\Temp/pilot_analysi
> s.log not found)
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Tornado_warnings\Experiment\Alerts_Experiment\Temp/pilot_analys
> is.log
  log type:  text
 opened on:  21 Jul 2021, 18:28:57

. set seed 135

. 
. 
. *Prepare the treatment characteristics to merge:
. import delimited using "./Input/exp_treatments_pilot.csv", varnames(1) clear 
> //I prepare this file separately in R, describes each potential treatment (pr
> ior prob+signal information structure)
(7 vars, 28 obs)

. drop v1

. 
. save "./Temp/exp_treatments_pilot.dta", replace
(note: file ./Temp/exp_treatments_pilot.dta not found)
file ./Temp/exp_treatments_pilot.dta saved

. 
. import delimited using "./Input/treatment_sequences.csv", varnames(1) clear /
> /I prepare this file separately in Excel, describes treatment order for each 
> group of subjects/session type
(7 vars, 6 obs)

. rename Ã¯seq seq

. reshape long r, i(seq) j(round) //so it is sequence - round structure to make
>  merging with the results file easier
(note: j = 1 2 3 4 5 6)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                        6   ->      36
Number of variables                   7   ->       3
j variable (6 values)                     ->   round
xij variables:
                           r1 r2 ... r6   ->   r
-----------------------------------------------------------------------------

. rename r treatn

. 
. merge m:1 treatn using "./Temp/exp_treatments_pilot.dta" //merging characteri
> stics of each treatment (prior prob, info structure = N of each gremlin types
> )
variable treatn not found
r(111);

end of do-file
r(111);
